#include <iostream>
//Проектирование программы в стиле ООП
// Игра 21:
// составные части:
//      карты (номинали, масти)
//      колода (набор карт)
//      игроки (имя, деньги, рука)
//      правила (какой колодой играют, сколько игроков, как игра начинается
//      условия победы, правила ходов)
//      ведущий(для нашей программы данным управляющим будет сама программа)
//      стол(места игроков, ставки, колода, сброс, слоты для карты, цвет)
//      рука(набор карт у игрока)
//      
//
int main()
{
    std::cout << "Hello World!\n";
}

